app/controllers/pages_controller.rb

	def scoreboard
		@users = User.all
---
SELECT "users".* FROM "users"