app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
	    if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "remember_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def guest
		id = User.count + 1
		@user = User.new(username: "Guest_#{id}", password: "guestpass#{id}", password_confirmation: "guestpass#{id}")
		if @user.save!
---
SELECT COUNT(*) FROM "users"
INSERT INTO "users" ("created_at", "password_digest", "remember_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

	def update_stats
		respond_to do |format|
			format.js do
				if params[:wins] == "1" then current_user.add_win end
				if params[:losses] == "1" then current_user.add_loss end
				if params[:draws] == "1" then current_user.add_draw end
				current_user.save(validate: false)
---
UPDATE "users" SET "losses" = $1, "remember_token" = $2, "updated_at" = $3 WHERE "users"."id" = 2  [["losses", 1], ["remember_token", "pejLArrNntS3Fc7MTNOL4w"], ["updated_at", Sat, 28 Jun 2014 04:15:32 UTC +00:00]]